study/correlation_validation/case_snappy_Re2000/0/domain6/p
FoamFile { version 2.0; format ascii; class volScalarField; object p; }
dimensions [1 -1 -2 0 0 0 0];
internalField uniform 0;
boundaryField {
    top { type symmetry; }
    bottom { type symmetry; }
    front { type symmetry; }
    back { type symmetry; }
    domain6_to_fluid { type calculated; value uniform 0; }
    domain6_to_domain8 { type calculated; value uniform 0; }
}
