study/correlation_validation/case_snappy_Re2000/0/domain8/T
FoamFile { version 2.0; format ascii; class volScalarField; object T; }
dimensions [0 0 0 1 0 0 0];
internalField uniform 320;
boundaryField {
    front { type symmetry; }
    back { type symmetry; }
    domain8_to_domain6 { type compressible::turbulentTemperatureCoupledBaffleMixed; Tnbr T; kappaMethod solidThermo; value uniform 320; }
}
