study/correlation_validation/case_snappy_Re2000/0/domain8/p
FoamFile { version 2.0; format ascii; class volScalarField; object p; }
dimensions [1 -1 -2 0 0 0 0];
internalField uniform 0;
boundaryField {
    front { type symmetry; }
    back { type symmetry; }
    domain8_to_domain6 { type calculated; value uniform 0; }
}
