study/correlation_validation/case_snappy_Re2000/0/domain9/T
FoamFile { version 2.0; format ascii; class volScalarField; object T; }
dimensions [0 0 0 1 0 0 0];
internalField uniform 320;
boundaryField {
    top { type symmetry; }
    front { type symmetry; }
    back { type symmetry; }
    domain9_to_solid { type compressible::turbulentTemperatureCoupledBaffleMixed; Tnbr T; kappaMethod solidThermo; value uniform 320; }
}
