study/correlation_validation/case_snappy_Re2000/0/domain9/p
FoamFile { version 2.0; format ascii; class volScalarField; object p; }
dimensions [1 -1 -2 0 0 0 0];
internalField uniform 0;
boundaryField {
    top { type symmetry; }
    front { type symmetry; }
    back { type symmetry; }
    domain9_to_solid { type calculated; value uniform 0; }
}
