study/correlation_validation/case_snappy_Re2000/0/fluid/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 300.0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 300.0;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            symmetry;
    }
    bottom
    {
        type            symmetry;
    }
    front
    {
        type            symmetry;
    }
    back
    {
        type            symmetry;
    }
fluid_to_domain3
{
    type            compressible::turbulentTemperatureCoupledBaffleMixed;
    Tnbr            T;
    kappaMethod     fluidThermo;
    value           uniform 300.0;
}
fluid_to_domain5
{
    type            compressible::turbulentTemperatureCoupledBaffleMixed;
    Tnbr            T;
    kappaMethod     fluidThermo;
    value           uniform 300.0;
}
fluid_to_domain6
{
    type            compressible::turbulentTemperatureCoupledBaffleMixed;
    Tnbr            T;
    kappaMethod     fluidThermo;
    value           uniform 300.0;
}
fluid_to_solid
{
    type            compressible::turbulentTemperatureCoupledBaffleMixed;
    Tnbr            T;
    kappaMethod     fluidThermo;
    value           uniform 300.0;
}
}
