study/correlation_validation/case_snappy_Re2000/0/fluid/p_rgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      p_rgh;
}

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    top
    {
        type            symmetry;
    }
    bottom
    {
        type            symmetry;
    }
    front
    {
        type            symmetry;
    }
    back
    {
        type            symmetry;
    }
fluid_to_domain3
{
    type            fixedFluxPressure;
}
fluid_to_domain5
{
    type            fixedFluxPressure;
}
fluid_to_domain6
{
    type            fixedFluxPressure;
}
fluid_to_solid
{
    type            fixedFluxPressure;
}
}
