study/correlation_validation/case_snappy_Re2000/0/solid/p
FoamFile { version 2.0; format ascii; class volScalarField; object p; }
dimensions [1 -1 -2 0 0 0 0];
internalField uniform 0;
boundaryField {
    top { type symmetry; }
    bottom { type symmetry; }
    front { type symmetry; }
    back { type symmetry; }
    solid_to_domain9 { type calculated; value uniform 0; }
    solid_to_fluid { type calculated; value uniform 0; }
    solid_to_domain2 { type calculated; value uniform 0; }
}
