study/correlation_validation/case_snappy_Re2000/constant/domain3/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/domain3";
    object      thermophysicalProperties;
}

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIso;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight   26.98;
    }
    thermodynamics
    {
        Cp          900.0;
        Hf          0;
    }
    transport
    {
        kappa       200.0;
    }
    equationOfState
    {
        rho         2700.0;
    }
}
