study/correlation_validation/case_snappy_Re2000/constant/domain6/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/domain6";
    object      turbulenceProperties;
}

simulationType  laminar;
