study/correlation_validation/case_snappy_Re2000/constant/fluid/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      thermophysicalProperties;
}

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight   28.96;
    }
    thermodynamics
    {
        Cp          1005.0;
        Hf          0;
    }
    transport
    {
        mu          1.846e-05;
        Pr          0.707;
        kappa       0.0263;
    }
    equationOfState
    {
        rho         1.177;
    }
}
