study/correlation_validation/case_snappy_Re2000/constant/regionProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      regionProperties;
}

regions
(
    fluid (fluid)
    solid (domain10 domain2 domain3 domain4 domain5 domain6 domain7 domain8 domain9 solid)
);
