study/correlation_validation/case_snappy_Re2000/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (0 0 0)
    (0.23800000000000002 0 0)
    (0.23800000000000002 0.036 0)
    (0 0.036 0)
    (0 0 0.013499999999999998)
    (0.23800000000000002 0 0.013499999999999998)
    (0.23800000000000002 0.036 0.013499999999999998)
    (0 0.036 0.013499999999999998)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (119 18 7) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    top
    {
        type symmetry;
        faces
        (
            (3 7 6 2)
        );
    }
    bottom
    {
        type symmetry;
        faces
        (
            (0 1 5 4)
        );
    }
    front
    {
        type symmetry;
        faces
        (
            (4 5 6 7)
        );
    }
    back
    {
        type symmetry;
        faces
        (
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);
