study/correlation_validation/case_snappy_Re2000/system/domain4/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    "(h|T)"
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
}

relaxationFactors
{
    equations
    {
        "(h|T)"         0.5;
    }
}
