study/correlation_validation/case_snappy_Re2000/system/domain7/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(p_rgh)     Gauss linear;
    grad(U)         Gauss linear;
}

divSchemes
{
    default               none;
    div(phi,U)            Gauss linearUpwind grad(U);
    div(phi,k)            Gauss upwind;
    div(phi,epsilon)      Gauss upwind;
    div(phi,omega)        Gauss upwind;
    div(phi,K)            Gauss upwind;
    div(phi,h)            Gauss linearUpwind grad(h);
    div(phi,T)            Gauss linearUpwind grad(T);
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p_rgh           ;
    pcorr           ;
}
