study/correlation_validation/case_snappy_Re2000/system/fluid/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
solvers
{
    p_rgh { solver GAMG; tolerance 1e-8; relTol 0.001; smoother DICGaussSeidel; }
    "(U|h|T)" { solver PBiCGStab; preconditioner DILU; tolerance 1e-9; relTol 0.001; }
}
SIMPLE { nNonOrthogonalCorrectors 2; pRefCell 0; pRefValue 0; consistent yes; }
relaxationFactors
{
    equations { U 0.5; h 0.3; }
    fields { p_rgh 0.5; rho 0.8; }
}
